<?php

declare(strict_types = 1);

//TODO:	あとで追加、修正するべき機能がある。
//FIXME: 既知の不具合があるコード。修正が必要。
//XXX: 危険！動くけどなぜうごくかわからない。
//WARNING: 注意が必要。
//BUG: バグ。予期せぬ動作になるコードの際に記述する。
//DEBUG: デバッグ予定の箇所。
//REVIEW: 意図した通りに動くか、見直す必要がある。
//HACK: あまりきれいじゃないコード。リファクタリングが必要。
//OPTIMIZE: 無駄が多く、ボトルネックになっている。
//CHANGED: コードをどのように変更したか。
//NOTE: なぜ、こうなったという情報を残す。
//IDEA: 思いついたアイデアを取り合えず記述する。
//QUESTION: どうしてこのような実装にしたか分からない時。
//COMEBACK: 後で戻ってきてほしい時。
//TEMP: 仮実装。取り合えず実装して後で修正したい時。
//引用元: https://qiita.com/taka-kawa/items/673716d77795c937d422
